====== EDA packages ========
1) Pandas: Data frame applications
2) Numpy: Numerical python 
3) Matplotlib
4) Seaborn
5) plotly
6) Bokhe

==========Machine Learning==========

7) scikit-learn:sklearn

=========Deep learning=========

8) Tensorflow: Google
9) Keras: Google
10) Pytorch: Facebook

========NLP===========

11) NLTK: Natural language tool kit
12) Scipy

=========BERT============

13) Transformers: Hugging face (Google)

=========Google model============

14) Specific google packages

=====Azure=========

15) Azure packages

=====GenAI=======

16) Gemini google

17) ChatGPT : OpenAI

=========Langchain========

18) Langchain packages

## Create a Dataframe using list ##

- list to dictonary
- dictionary to list

$Step -1$

**Create a dataframe**

In [2]:
import pandas as pd
names=['ayush','avinash','akash']
pd.DataFrame()  # empty dataframe no rows & no columns

Empty DataFrame
Columns: []
Index: []

$Step-2$

**Provide the data**

In [7]:
names=['ayush','avinash','akash']
pd.DataFrame(names)

         0
0    ayush
1  avinash
2    akash

In [8]:
names=['ayush','avinash','akash']
age=[22,24,25]
pd.DataFrame(zip(names,age))
# what is the first positional argument: data
# second positional argument: index

         0   1
0    ayush  22
1  avinash  24
2    akash  25

In [10]:
names=['ayush','avinash','akash']
age=[22,24,25]
city=['Mumbai','Shillong','Jammu']
pd.DataFrame(zip(names,age,city))

         0   1         2
0    ayush  22    Mumbai
1  avinash  24  Shillong
2    akash  25     Jammu

In [17]:
names=['ayush','avinash','akash']
age=[22,24,25]
city=['Mumbai','Shillong','Jammu']
data=zip(names,age)
pd.DataFrame(data,city)

                0   1
Mumbai      ayush  22
Shillong  avinash  24
Jammu       akash  25

$Step-3$

**Provide the column names**

In [13]:
names=['ayush','avinash','akash']
age=[22,24,25]
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])

     Names  Age
0    ayush   22
1  avinash   24
2    akash   25

In [3]:
names=['ayush','avinash','akash']
age=[22,24,25]
city=['Mumbai','Shillong','Jammu']

data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)
df

     Names  Age      City
0    ayush   22    Mumbai
1  avinash   24  Shillong
2    akash   25     Jammu

In [23]:
type(df)

pandas.core.frame.DataFrame

$Step-4$

**Add new column**

- if you want add new column
- first you have to check the number of rows in already existed data
- for e.g. in above dataframe - it has 3 rows
- you have to create new list with 3 rows
- that list equate to the dataframe

In [24]:
job = ['DS','DE','CS']
df['Job']=job
df

     Names  Age      City Job
0    ayush   22    Mumbai  DS
1  avinash   24  Shillong  DE
2    akash   25     Jammu  CS

In [25]:
names=['ayush','avinash','akash']
age=[22,24,25]
city=['Mumbai','Shillong','Jammu']

data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)
df

     Names  Age      City
0    ayush   22    Mumbai
1  avinash   24  Shillong
2    akash   25     Jammu

In [26]:
job = ['DS','DE','CS']
df['Job']=job
df

     Names  Age      City Job
0    ayush   22    Mumbai  DS
1  avinash   24  Shillong  DE
2    akash   25     Jammu  CS

$Step-5$

**Update the already existing column**

- create new column and update new column both are done same way

In [27]:
df['Age']=[30,28,26]
df

     Names  Age      City Job
0    ayush   30    Mumbai  DS
1  avinash   28  Shillong  DE
2    akash   26     Jammu  CS

$Step-6$

**Change the index**

In [37]:
names=['ayush','avinash','akash','anvi']
age=[22,24,25,27]
city=['Mumbai','Shillong','Jammu','Manali']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Names  Age      City
A    ayush   22    Mumbai
B  avinash   24  Shillong
C    akash   25     Jammu
D     anvi   27    Manali

**Note**
- Number of list equals to Number of Columns
- Number of values inside list equals to NUmber of rows
- when you craete data all the lists will be in same length

In [29]:
names=['ayush','avinash','akash','anvi']
age=[22,24,25]
city=['Mumbai','Shillong','Jammu','Manali']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx,columns=cols)
df

ValueError: Length of values (3) does not match length of index (4)

$Step-7$

**Shape**
- Number of rows
- Number of columns

In [38]:
df.shape
# Matrix format
# 4 rows & 3 columns

print("number of rows are: ",df.shape[0])
print("number of columns are: ",df.shape[1])

number of rows are:  4
number of columns are:  3

$Step-8$

**Drop the column**

- In order to drop the column we require 3 arguments
- Column name
    - the column name we need to mention
- axis
    - axis = 0 represents rows
    - axis = 1 represents columns
- inplace
    - droppnig a column means we are modifying the data frame
    - so this modification we want to save in same variable or different variable
    - if you want keep in same variable  the inplace=True

In [40]:
df

     Names  Age      City
A    ayush   22    Mumbai
B  avinash   24  Shillong
C    akash   25     Jammu
D     anvi   27    Manali

In [43]:
df.drop('City',
        axis=1,
        inplace=True)

## df.drop('City',axis=1,inplace=True) -- it gives error

KeyError: "['City'] not found in axis"

In [44]:
df

     Names  Age
A    ayush   22
B  avinash   24
C    akash   25
D     anvi   27

In [45]:
df1=df.drop('Age',axis=1)  # do not give inplace=True

In [46]:
df # has two columns

     Names  Age
A    ayush   22
B  avinash   24
C    akash   25
D     anvi   27

In [47]:
df1

     Names
A    ayush
B  avinash
C    akash
D     anvi

In [55]:
import pandas as pd
names=['ayush','avinash','akash','anvi']
age=[22,24,25,27]
city=['Mumbai','Shillong','Jammu','Manali']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age      City
A    ayush   22    Mumbai
B  avinash   24  Shillong
C    akash   25     Jammu
D     anvi   27    Manali

In [49]:
df.drop('City',axis=1,inplace=True)

In [50]:
df

     Names  Age
A    ayush   22
B  avinash   24
C    akash   25
D     anvi   27

In [51]:
df1=df.drop('Age',axis=1)    # do not give inplace=True

In [53]:
df

     Names  Age
A    ayush   22
B  avinash   24
C    akash   25
D     anvi   27

In [54]:
df1

     Names
A    ayush
B  avinash
C    akash
D     anvi

In [65]:
import pandas as pd
names=['ayush','avinash','akash','anvi']
age=[22,24,25,27]
city=['Mumbai','Shillong','Jammu','Manali']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age      City
A    ayush   22    Mumbai
B  avinash   24  Shillong
C    akash   25     Jammu
D     anvi   27    Manali

In [66]:
df.drop('City',axis=1,inplace=True)

In [67]:
df

     Names  Age
A    ayush   22
B  avinash   24
C    akash   25
D     anvi   27

In [68]:
df.drop('Age',axis=1)

     Names
A    ayush
B  avinash
C    akash
D     anvi

In [69]:
df

     Names  Age
A    ayush   22
B  avinash   24
C    akash   25
D     anvi   27

$Step-9$

**Multiple columns drop**

In [70]:
#again read the data

import pandas as pd
names=['ayush','avinash','akash','anvi']
age=[22,24,25,27]
city=['Mumbai','Shillong','Jammu','Manali']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']

df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age      City
A    ayush   22    Mumbai
B  avinash   24  Shillong
C    akash   25     Jammu
D     anvi   27    Manali

In [72]:
df.drop(['Age','City'],axis=1,inplace=True)

In [73]:
df

     Names
A    ayush
B  avinash
C    akash
D     anvi

$Step-10$

**Drop the rows**

In [1]:
#again read the data

import pandas as pd
names=['ayush','avinash','akash','anvi']
age=[22,24,25,27]
city=['Mumbai','Shillong','Jammu','Manali']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']

df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age      City
A    ayush   22    Mumbai
B  avinash   24  Shillong
C    akash   25     Jammu
D     anvi   27    Manali

In [76]:
df.drop('A',axis=0,inplace=True)

In [77]:
df

     Names  Age      City
B  avinash   24  Shillong
C    akash   25     Jammu
D     anvi   27    Manali

$Step-11$

**How to save the data frame**

- generally data frames are two types
- csv (comma separated values)
- excel

In [78]:
df

     Names  Age      City
B  avinash   24  Shillong
C    akash   25     Jammu
D     anvi   27    Manali

In [88]:
## file name = data
# extension=.csv

df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [89]:
#extension 
# .xlsx
df.to_excel("data2.xlsx",index=False)

In [90]:
#again read the data

import pandas as pd
names=['ayush','avinash','akash','anvi']
age=[22,24,25,27]
city=['Mumbai','Shillong','Jammu','Manali']
country=['India','India','India','India']

data=zip(names,age,city,country)
cols=['Names','Age','City','Country']
idx=['A','B','C','D']

df_b=pd.DataFrame(data,index=idx,columns=cols)
df_b

     Names  Age      City Country
A    ayush   22    Mumbai   India
B  avinash   24  Shillong   India
C    akash   25     Jammu   India
D     anvi   27    Manali   India

In [86]:
df_b.drop('A',axis=0,inplace=True)

In [87]:
df_b

     Names  Age      City Country
B  avinash   24  Shillong   India
C    akash   25     Jammu   India
D     anvi   27    Manali   India